// html select value 변경
window.onload = async () => {
  const fileURL = "/dataBase/juSo.csv";
  const locNameArr = await getLocalData(fileURL);
  console.log(getLocalData(fileURL));

  let changeDosi = document.getElementById("sel_doSi");

  createDosiList(locNameArr);
  createSigunguList(locNameArr);

  // 도/광역시 변경 이벤트 발생 시
  changeDosi.onchange = function() {
    deleteSigunguList();
    createSigunguList(locNameArr);
  };
}


//=====================================사용된 함수 목록=====================================
// 1-1.텍스트 나누고 배열에 저장(1.개행 기준, 2.comma 기준)
function textSplit(text) {
  let rows = text.split("\r\n"); // 읽은 파일을 개행을 기준으로 나누고 빈 객체에 입력

  let i = 0;
  for (let index in rows) {
    rows[i] = rows[index].split(",");
    rows[i] = rows[i].filter((e) => {return e !== "";}); // 배열에서 빈 값("")이 아닌 요소만 선택하여 저장
    i += 1;
  }

  rows.pop(); // 1차 배열 마지막 빈 배열 삭제
  return rows;
}

// 1-2.저장된 배열을 도/광역시, 시/군/구 배열로 분리
function arrayModify(arr) {
  let newArr = [];
  let i = 0;

  for(let index in arr) {
    newArr[i] = arr[i][0];
    arr[i].shift();
    i++;
  }

  // csv 첫 행 내용(항목명) 삭제
  newArr.shift();
  arr.shift();

  return [newArr, arr];
}




// 2-1.로컬주소에서 file 읽고 텍스트를 배열에 저장
async function getLocalData(local) {
  const promise = await fetch(local)
    .then((Response) => Response.arrayBuffer())
    .then((f) => new TextDecoder("euc-kr").decode(f));
    // .then((e) => textSplit(e));

  const arrPromise = textSplit(promise);
  let modifiedArr = arrayModify(arrPromise);

  // 도메인에서 로컬파일 못 읽어와서 행정구역 배열을 스크립트에 임의로 넣음
  if (modifiedArr[0].length === 0) {
    modifiedArr = administrativeDistrict;
  }
  return modifiedArr;
}

// 2-2.HTML <input>태그 통하여 file 읽고 텍스트를 배열에 저장(미사용)
function readCSV(input) {
  let csv = input.files[0];
  let reader = new FileReader();
  reader.readAsText(csv, "euc-kr");
  reader.onload = () => {
    const arrResult = textSplit(reader.result);
    arrayModify(arrResult);
  };
  
  reader.onerror = function () {
    alert(reader.error);
  };
}




// 3-1.도/광역시 행정구역 리스트 생성
function createDosiList(arr) {
  let selectDoSi = document.getElementById("sel_doSi");
  const doSi = arr[0];
  
  for(let i in doSi) {
    selectDoSi.options[i] = new Option(doSi[i],doSi[i]);
  }
  
  return doSi;
}

// 3-2.시/군/구 행정구역 리스트 생성
function createSigunguList(arr) {
  let selectDoSi = document.getElementById("sel_doSi");
  let selectSiGunGu = document.getElementById("sel_siGunGu");
  const doSi = arr[0];
  const siGunGu = arr[1];

  if(doSi.includes(selectDoSi.value) === true) {
    let j = doSi.indexOf(selectDoSi.value);

    for(let k in siGunGu[j]) {
      selectSiGunGu.options[k] = new Option(siGunGu[j][k],siGunGu[j][k]);
    }
  }
}

// 3-3.시/군/구 행정구역 리스트 초기화
function deleteSigunguList() {
  let selectSiGunGu = document.getElementById("sel_siGunGu");
  selectSiGunGu.options.length = 0;
}
//=====================================사용된 함수 목록=====================================


// 대한민국 행정구역 배열
// const administrativeDistrict = [[강원도,경기도,경상남도,경상북도,광주광역시,대구광역시,대전광역시,부산광역시,서울특별시,세종특별자치시,울산광역시,인천광역시,전라남도,전라북도,제주특별자치도,충청남도,충청북도], [강릉시,고성군,동해시,삼척시,속초시,양구군,양양군,영월군,원주시,인제군,정선군,철원군,춘천시,태백시,평창군,홍천군,화천군,횡성군], [가평군,고양시 덕양구,고양시 일산동구,고양시 일산서구,과천시,광명시,광주시,구리시,군포시,김포시,남양주시,동두천시,부천시,성남시 분당구,성남시 수정구,성남시 중원구,수원시 권선구,수원시 영통구,수원시 장안구,수원시 팔달구,시흥시,안산시 단원구,안산시 상록구,안성시,안양시 동안구,안양시 만안구,양주시,양평군,여주시,연천군,오산시,용인시 기흥구,용인시 수지구,용인시 처인구,의왕시,의정부시,이천시,파주시,평택시,포천시,하남시,화성시], [거제시,거창군,고성군,김해시,남해군,밀양시,사천시,산청군,양산시,의령군,진주시,창녕군,창원시 마산합포구,창원시 마산회원구,창원시 성산구,창원시 의창구,창원시 진해구,통영시,하동군,함안군,함양군,합천군], [경산시,경주시,고령군,구미시,군위군,김천시,문경시,봉화군,상주시,성주군,안동시,영덕군,영양군,영주시,영천시,예천군,울진군,의성군,청도군,청송군,칠곡군,포항시 남구,포항시 북구], [광산구,남구,동구,북구,서구], [남구,달서구,달성군,동구,북구,서구,수성구,중구], [대덕구,동구,서구,유성구,중구], [강서구,금정구,기장군,남구,동구,동래구,부산진구,북구,사상구,사하구,서구,수영구,연제구,영도구,중구,해운대구], [강남구,강동구,강북구,강서구,관악구,광진구,구로구,금천구,노원구,도봉구,동대문구,동작구,마포구,서대문구,서초구,성동구,성북구,송파구,양천구,영등포구,용산구,은평구,종로구,중구,중랑구], [세종특별자치시], [남구,동구,북구,울주군,중구], [강화군,계양구,남동구,동구,미추홀구,부평구,서구,연수구,옹진군,중구], [강진군,고흥군,곡성군,광양시,구례군,나주시,담양군,목포시,무안군,보성군,순천시,신안군,여수시,영광군,영암군,완도군,장성군,장흥군,진도군,함평군,해남군,화순군], [고창군,군산시,김제시,남원시,무주군,부안군,순창군,완주군,익산시,임실군,장수군,전주시 덕진구,전주시 완산구,정읍시,진안군], [서귀포시,제주시], [계룡시,공주시,금산군,논산시,당진시,보령시,부여군,서산시,서천군,아산시,예산군,천안시 동남구,천안시 서북구,청양군,태안군,홍성군], [괴산군,단양군,보은군,영동군,옥천군,음성군,제천시,증평군,진천군,청주시 상당구,청주시 서원구,청주시 청원구,청주시 흥덕구,충주시]];
const administrativeDistrict = [["강원도","경기도","경상남도","경상북도","광주광역시","대구광역시","대전광역시","부산광역시","서울특별시","세종특별자치시","울산광역시","인천광역시","전라남도","전라북도","제주특별자치도","충청남도","충청북도"], [["강릉시","고성군","동해시","삼척시","속초시","양구군","양양군","영월군","원주시","인제군","정선군","철원군","춘천시","태백시","평창군","홍천군","화천군","횡성군"], ["가평군","고양시 덕양구","고양시 일산동구","고양시 일산서구","과천시","광명시","광주시","구리시","군포시","김포시","남양주시","동두천시","부천시","성남시 분당구","성남시 수정구","성남시 중원구","수원시 권선구","수원시 영통구","수원시 장안구","수원시 팔달구","시흥시","안산시 단원구","안산시 상록구","안성시","안양시 동안구","안양시 만안구","양주시","양평군","여주시","연천군","오산시","용인시 기흥구","용인시 수지구","용인시 처인구","의왕시","의정부시","이천시","파주시","평택시","포천시","하남시","화성시"], ["거제시","거창군","고성군","김해시","남해군","밀양시","사천시","산청군","양산시","의령군","진주시","창녕군","창원시 마산합포구","창원시 마산회원구","창원시 성산구","창원시 의창구","창원시 진해구","통영시","하동군","함안군","함양군","합천군"], ["경산시","경주시","고령군","구미시","군위군","김천시","문경시","봉화군","상주시","성주군","안동시","영덕군","영양군","영주시","영천시","예천군","울진군","의성군","청도군","청송군","칠곡군","포항시 남구","포항시 북구"], ["광산구","남구","동구","북구","서구"], ["남구","달서구","달성군","동구","북구","서구","수성구","중구"], ["대덕구","동구","서구","유성구","중구"], ["강서구","금정구","기장군","남구","동구","동래구","부산진구","북구","사상구","사하구","서구","수영구","연제구","영도구","중구","해운대구"], ["강남구","강동구","강북구","강서구","관악구","광진구","구로구","금천구","노원구","도봉구","동대문구","동작구","마포구","서대문구","서초구","성동구","성북구","송파구","양천구","영등포구","용산구","은평구","종로구","중구","중랑구"], ["세종특별자치시"], ["남구","동구","북구","울주군","중구"], ["강화군","계양구","남동구","동구","미추홀구","부평구","서구","연수구","옹진군","중구"], ["강진군","고흥군","곡성군","광양시","구례군","나주시","담양군","목포시","무안군","보성군","순천시","신안군","여수시","영광군","영암군","완도군","장성군","장흥군","진도군","함평군","해남군","화순군"], ["고창군","군산시","김제시","남원시","무주군","부안군","순창군","완주군","익산시","임실군","장수군","전주시 덕진구","전주시 완산구","정읍시","진안군"], ["서귀포시","제주시"], ["계룡시","공주시","금산군","논산시","당진시","보령시","부여군","서산시","서천군","아산시","예산군","천안시 동남구","천안시 서북구","청양군","태안군","홍성군"], ["괴산군","단양군","보은군","영동군","옥천군","음성군","제천시","증평군","진천군","청주시 상당구","청주시 서원구","청주시 청원구","청주시 흥덕구","충주시"]]];
console.log("텍스트로...", administrativeDistrict);